kalix9999/speed_wagon/stm32f4/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define seg_12_Pin GPIO_PIN_6
#define seg_12_GPIO_Port GPIOA
#define seg_9_Pin GPIO_PIN_7
#define seg_9_GPIO_Port GPIOA
#define seg_6_Pin GPIO_PIN_7
#define seg_6_GPIO_Port GPIOC
#define seg_5_Pin GPIO_PIN_8
#define seg_5_GPIO_Port GPIOC
#define seg_11_Pin GPIO_PIN_9
#define seg_11_GPIO_Port GPIOC
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define seg_1_Pin GPIO_PIN_10
#define seg_1_GPIO_Port GPIOC
#define seg_3_Pin GPIO_PIN_11
#define seg_3_GPIO_Port GPIOC
#define seg_2_Pin GPIO_PIN_12
#define seg_2_GPIO_Port GPIOC
#define seg_4_Pin GPIO_PIN_2
#define seg_4_GPIO_Port GPIOD
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define seg_8_Pin GPIO_PIN_6
#define seg_8_GPIO_Port GPIOB
#define seg_10_Pin GPIO_PIN_8
#define seg_10_GPIO_Port GPIOB
#define seg_7_Pin GPIO_PIN_9
#define seg_7_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
